** Evil Expat
Adds the following ex commands:

| :reverse           | reverse visually selected lines                                |
| :remove            | remove current file and its buffer                             |
| :rename NEW-PATH   | rename or move current file and its buffer                     |
| :colorscheme THEME | change emacs color theme                                       |
| :diff-orig         | get a diff of unsaved changes, like vim's common :DiffOrig     |
| :gdiff             | BRANCH git-diff current file, requires magit and vdiff-magit   |
| :gblame            | git-blame current file, requires magit                         |
| :gremove           | git remove current file, requires magit                        |
| :tyank             | copy range into tmux paste buffer, requires running under tmux |
| :tput              | paste from tmux paste nuffer, requires running under tmux      |

#+BEGIN_SRC emacs-lisp
  (use-package evil-expat
    :straight (:host github :repo "edkolev/evil-expat" :branch "master")
    :defer 1)
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23491 21551 225109 0) :init (23491 21551 225102 0) :init-secs (0 0 162 0) :use-package-secs (0 3 112048 0)))

** Comment using text objects
#+BEGIN_SRC emacs-lisp
  (use-package evil-commentary
    :straight (:host github :repo "linktohack/evil-commentary"
               :branch "master")
    :after (evil)
    :defer 1
    :config
    (evil-commentary-mode))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23491 21900 791656 0) :init (23491 21900 791644 0) :config (23491 21900 791296 0) :config-secs (0 0 644 0) :init-secs (0 0 5333 0) :use-package-secs (0 3 261718 0)))

** Targets
#+BEGIN_SRC emacs-lisp
  (use-package targets
    :after (evil)
    :defer 1
    :straight (:host github :repo "noctuid/targets.el"
               :branch "master")
    :config
    (targets-setup t))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23491 21459 909411 0) :init (23491 21459 909406 0) :config (23491 21459 909399 0) :config-secs (0 0 208796 0) :init-secs (0 0 208835 0) :use-package-secs (0 0 477236 0)))

** Org Capture Bindings

#+BEGIN_SRC emacs-lisp
  (use-package org-capture
    :ensure nil ;; because org-capture is from org
    :after (org)
    :defer 1
    :commands (org-capture
               org-capture-templates)
    :general
    (:prefix my-default-evil-leader-key
     :states 'normal
     "c c" '(lambda () (interactive)
              (require 'org-capture)
              (helm-org-capture-templates)))
     ;; "c j" '((lambda () (interactive) (org-capture nil "j"))
     ;;         :which-key "Capture journal entry")
     ;; "c d" '((lambda () (interactive) (org-capture nil "d"))
     ;;         :which-key "Capture daydream entry"))
    (:prefix my-default-evil-leader-key
     :keymaps 'org-capture-mode-map
     :states 'normal
     "r r" 'org-capture-refile)
    (org-capture-mode-map
     [remap evil-save-and-close]          'org-capture-finalize
     [remap evil-save-modified-and-close] 'org-capture-finalize
     [remap evil-quit]                    'org-capture-kill)
    :init
    ;; (defun my-capture-daydream ()
    ;;   ""
    ;;   (interactive)
    ;;   (org-capture nil "d")
    ;; (evil-ex-define-cmd "todo" 'my-capture-daydream)
    :config
    ;; when inserting a heading immediately go into insert mode
    (add-hook 'org-capture-mode-hook 'evil-insert-state))
    ;; (when (boundp 'my-journal-org-file)
    ;;   (add-to-list 'org-capture-templates
    ;;                `("j" "Journal Entry" entry
    ;;                  (file ,my-journal-org-file)
    ;;                  "* %U\n%?")
    ;; (when (boundp 'my-daydream-org-file)
    ;;   (add-to-list 'org-capture-templates
    ;;                `("d" "Daydream Entry" entry
    ;;                  (file ,my-daydream-org-file)
    ;;                  "* %? \n %U"))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23491 20845 78356 0) :init (23491 20845 78014 0) :init-secs (0 0 36 0) :use-package-secs (0 0 439 0)))

** Yasnippet

#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :defer 3
    :straight (:host github :repo "joaotavora/yasnippet" :branch "master")
    :commands (yas-minor-mode
               yas-expand-snippet)
    :general
    (yas-keymap
     "C-j" 'yas-next-field-or-maybe-expand
     "C-k" 'yas-prev-field)
    (:states 'normal
     :prefix my-default-evil-leader-key
     "s s" 'yas-new-snippet
     "s a" 'yas-insert-snippet
     "s f" 'yas-visit-snippet-file)
    (snippet-mode-map
     [remap evil-save-and-close]          'yas-load-snippet-buffer-and-close
     [remap evil-save-modified-and-close] 'yas-load-snippet-buffer-and-close
     [remap evil-quit]                    'kill-this-buffer)
    :config
    (let ((my-snippet-dir (directory-file-name
                           (concat user-init-dir "/snippets"))))
      (setq-default yas-snippet-dirs `(,my-snippet-dir)))
    (setq yas-indent-line 'auto
          yas-also-auto-indent-first-line t)
    (defun yas-with-comment (str)
      (format "%s%s%s" comment-start str comment-end))
    (yas-global-mode))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23491 17807 912103 0) :init (23491 17807 911669 0) :config (23491 17807 911661 0) :config-secs (0 0 37289 0) :init-secs (0 0 37324 0) :use-package-secs (0 0 141288 0)))

** Smartparens
#+BEGIN_SRC emacs-lisp
  (use-package smartparens
    :defer 2
    :straight (:host github :repo "Fuco1/smartparens" :branch "master")
    :diminish smartparens-mode
    :commands (sp-local-pair)
    :general
    (:states 'normal
     :prefix my-default-evil-leader-key
     "." 'smartparens-mode)
    :custom
    (sp-cancel-autoskip-on-backward-movement
     nil
     "We want to maintain the chomp-like behavior of electric-pair")
    (sp-autoskip-closing-pair
     'always
     "Maintain chomp-like behavior of electric-pair")
    :config
    (require 'smartparens-config) ;; load some default configurations
    (smartparens-global-mode)
    ;;(smartparens-global-strict-mode)
    ;;(show-smartparens-global-mode)
    ;; define some helper functions
    (defun my-add-newline-and-indent-braces (&rest _)
      "adds that cool vim indent thing we always wanted"
      (newline)
      (indent-according-to-mode)
      (forward-line -1)
      (indent-according-to-mode))
    ;; update the global definitions with some indenting
    ;; I think that the nil is the flag that controls property inheritance
    ;;note: for some reason tab isn't recognised. might be yasnippet intefering.
    ;;learn to use ret for now
    (sp-pair "{" nil :post-handlers '((my-add-newline-and-indent-braces "RET")))
    (sp-pair "[" nil :post-handlers '((my-add-newline-and-indent-braces "RET")))
    (sp-pair "(" nil :post-handlers '((my-add-newline-and-indent-braces "RET"))))
#+END_SRC

#+results:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (23491 14501 447070 0) :init (23491 14501 446922 0) :init-secs (0 0 73407 0) :use-package-secs (0 0 188038 0) :config (23491 14501 446915 0) :config-secs (0 0 73357 0)))

